{"meta":{"title":"Ang. Z","subtitle":null,"description":"My hand is cold, but my heart is gold","author":"Ang. Z","url":"https://zayyyy.github.io/Blog"},"pages":[{"title":"Hello World","date":"2017-05-11T16:26:50.000Z","updated":"2017-05-11T16:26:50.000Z","comments":true,"path":"hello-world.html","permalink":"https://zayyyy.github.io/Blog/hello-world.html","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment"},{"title":"All Categories","date":"2017-05-11T10:10:56.000Z","updated":"2017-05-11T16:28:41.000Z","comments":false,"path":"categories/index.html","permalink":"https://zayyyy.github.io/Blog/categories/index.html","excerpt":"","text":""},{"title":"All Tags","date":"2017-05-11T10:13:29.000Z","updated":"2017-05-11T16:28:40.000Z","comments":false,"path":"tags/index.html","permalink":"https://zayyyy.github.io/Blog/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Computer Vision Project -- Insturct an exercise session","slug":"Intelligent-System","date":"2017-05-29T11:35:28.000Z","updated":"2017-07-13T08:18:49.000Z","comments":true,"path":"2017/05/29/Intelligent-System/","link":"","permalink":"https://zayyyy.github.io/Blog/2017/05/29/Intelligent-System/","excerpt":"Introduction We did this project using robot(i.e virtual NAO robot) and managed to implement 6 postures and achieve a specific purpose. It is a fact that exercise on a regular basis plays a crucial role for people who are the old with chronicle illnesses or people just recovering from an accident. However, because of limited resource of medical staff and probably the embarrassment of patients in understanding, learning and executing the tasks, robots, fortunately, can be a better choice to help with both problems. Therefore, we are going to implement this task and aim to prove that it is feasible and plausible. Finally, it has been shown that robot was definitely able to instruct successful exercises and even sometimes are more friendly and impatient for people to execute those exercises than their human counterparts.","text":"Introduction We did this project using robot(i.e virtual NAO robot) and managed to implement 6 postures and achieve a specific purpose. It is a fact that exercise on a regular basis plays a crucial role for people who are the old with chronicle illnesses or people just recovering from an accident. However, because of limited resource of medical staff and probably the embarrassment of patients in understanding, learning and executing the tasks, robots, fortunately, can be a better choice to help with both problems. Therefore, we are going to implement this task and aim to prove that it is feasible and plausible. Finally, it has been shown that robot was definitely able to instruct successful exercises and even sometimes are more friendly and impatient for people to execute those exercises than their human counterparts. We divided the work into two main parts: Movement Design and Posture Classification Analysis. Firstly, considering that both a human and the NAO robot should be able to perform those postures in a similar manner, we selected six different exercises. Secondly, Choregraphe was used to design and generate postures, i.e standard data of each posture and displayed those exercises that people should imitate. Kinect was used to extract data from the posture’s learner including the standard data of those 6 postures which was labeled manually. Then, SVM , a supervised learning model, was trained on those labeled data, then was used to analyze the human exercises and classify those extracted data. In addition, the interaction with system was implemented by using Terminal Command Line to give feedback on their performance, including some specific interaction with posture’s learner, for example, a precise feedback: “Please put the left arm a little higher”, mainly because that virtual robot did not have speakers. By setting correction criterion for “wrong” and “right” posture, namely, a boundary value, modification suggestion was generated and then displayed in the command line. In the end, with the help of robot’s modification suggestions, the learner succeeded performing all of 6 postures. Week 1 Progress Webot part: We designed 6 postures but some are too complicated when setting the virtual robot. The adjustable range of angles in choregraphe is too small to achieve some postures, so we need to simplify our postures. Pose estimation: We followed the instruction of 2D articulated human pose estimation software. Luckily, the example of human pose estimation works well. However, when we want to detect upperbody or fullbody to get the bounding box of our dataset, there are some problems with the calvin upper-body detector. The provided voc-release file is too old without maintenance. In this case, we have to change our plan. Reference:pose estimation: http://groups.inf.ed.ac.uk/calvin/articulated_human_pose_estimation_code/body detector:http://groups.inf.ed.ac.uk/calvin/calvin_upperbody_detector/ Issues MATLAB can’t recognize the complier (Xcode 8.x) on Mac. 1234&gt;&gt; mex -setupError using mexNo supported compiler or SDK was found. For options, visithttp://www.mathworks.com/support/compilers/R2016a/maci64.html. Solution: The reason could be the sdk for your mac version isn’t linked to MATLAB. Edit the file: yourMatlabRoot/bin/maci64/mexopts/clang++_maci64.xml Edit the file: yourMatlabRoot/bin/maci64/mexopts/clang_maci64.xml Add following 2 sentences in &lt; ISYSROOT &gt; &lt; SYSROOT &gt; and &lt; SDKVER &gt; &lt; SDKVER &gt; 12&lt;dirExists name=&quot;$$/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.12.sdk&quot; /&gt;&lt;cmdReturns name=&quot;find $$ -name MacOSX10.12.sdk&quot; /&gt; So the code block will look like this: 123456789101112131415161718192021222324252627282930313233&lt;ISYSROOT&gt;&lt;and&gt;&lt;cmdReturns name=&quot;xcode-select -print-path&quot;/&gt;&lt;or&gt;&lt;dirExists name=&quot;$$/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.9.sdk&quot; /&gt;&lt;dirExists name=&quot;$$/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.10.sdk&quot; /&gt;&lt;dirExists name=&quot;$$/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.11.sdk&quot; /&gt;&lt;dirExists name=&quot;$$/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.12.sdk&quot; /&gt;&lt;cmdReturns name=&quot;find $$ -name MacOSX10.9.sdk&quot; /&gt;&lt;cmdReturns name=&quot;find $$ -name MacOSX10.10.sdk&quot; /&gt;&lt;cmdReturns name=&quot;find $$ -name MacOSX10.11.sdk&quot; /&gt;&lt;cmdReturns name=&quot;find $$ -name MacOSX10.12.sdk&quot; /&gt;&lt;/or&gt;&lt;/and&gt;&lt;/ISYSROOT&gt;&lt;SDKVER&gt;&lt;and&gt;&lt;and&gt;&lt;cmdReturns name=&quot;xcode-select -print-path&quot;/&gt;&lt;or&gt;&lt;dirExists name=&quot;$$/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.9.sdk&quot; /&gt;&lt;dirExists name=&quot;$$/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.10.sdk&quot; /&gt;&lt;dirExists name=&quot;$$/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.11.sdk&quot; /&gt;&lt;dirExists name=&quot;$$/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.12.sdk&quot; /&gt;&lt;cmdReturns name=&quot;find $$ -name MacOSX10.9.sdk&quot; /&gt;&lt;cmdReturns name=&quot;find $$ -name MacOSX10.10.sdk&quot; /&gt;&lt;cmdReturns name=&quot;find $$ -name MacOSX10.11.sdk&quot; /&gt;&lt;cmdReturns name=&quot;find $$ -name MacOSX10.12.sdk&quot; /&gt;&lt;/or&gt;&lt;/and&gt;&lt;cmdReturns name=&quot;echo $$ | rev | cut -c1-10 | rev | egrep -oh &apos;[0-9]+\\.[0-9]+&apos;&quot; /&gt;&lt;/and&gt;&lt;/SDKVER&gt; Reference:https://cn.mathworks.com/matlabcentral/answers/246507-why-can-t-mex-find-a-supported-compiler-in-matlab-r2015b-after-i-upgraded-to-xcode-7-0/ Error message in Matlab when using voc-release file: Undefined function ‘resize’ for input arguments of type ‘double’. 12345678910111213Undefined function &apos;resize&apos; for input arguments of type &apos;double&apos;.Error in featpyramid (line 22)scaled = resize(im, 1/sc^(i-1));Error in detect (line 69)[feat, scales] = featpyramid(input, model.sbin, interval);Error in DetectStillImage (line 35)boxes = detect(tempimg, pffmodel,det_pars.ubfpff_thresh);Error in DetectAndEstimDir (line 26)detections = DetectStillImage(fullfile(img_dir,Files(idx).name),pffubfmodel_path,facemodel_path,det_pars,verbose); The definition of the function of resize in resize.cc is: 1mxArray *resize(const mxArray *mxsrc, const mxArray *mxscale) &#123;&#125; The input type is mxArrar, not double type. But changing it into double type dosen’t work. No solution now. Week 2 ProgressSince using MATLAB to extract posture data is infeasible, we decided to work on Kinect to get the skeleton data. We have looked up dozens of documentation and found that MacOS can be connected to Kinect. After fixing a lot of problems when installing the Kinect SDK on Mac, we successfully ran the Kinect. However, we found there is no way to call Pykinect library for programming except using Windows OS. The most ridiculous thing is that all of our group member don’t have Windows laptop. We had no choice but worked on the computer in the laboratory which needed the administrator’s account to install Kinect SDK and other python packages on VS 2013. Due to the above, We wasted lots of time and encountered many problems about pygame enviroment before we can start programming. Reference:http://blog.nelga.com/setup-microsoft-kinect-on-mac-os-x-10-9-mavericks/https://github.com/Microsoft/PTVS/wiki/PyKinect Issues Can’t access python environment correctly. Solution: Open solution explorer, set the python environment to the right path. We recommond to add virtual environment rather than the global environment. Can’t import pygame and other python package. Solution: Download the required packages. Open solution explorer. Right-click on the Python environment and select Install Python Package. Type the full path to the “Search PyPI and installed packages” box. Notice: the pip version need to be upgraded to the latest one, or the python package would fail to be installed. Week 3 Final resultDue to the limitation of devices for developing the project last 2 weeks, we finally borrowed a Windows laptop to code this week. In order to work effienctly, we divided our work into 2 parts, which are training model and matching postures. Training model: Training on our robot’s data. 26 attributes (26 flexible angles from choregraphe) Using SVM Performs very well Training on real data 11 attributes (8 posture angles and 3 orientations) Also very well Due to the need of large dataset, we use normal distrubution to generate 6000 simulation data (1000 data for each posture). μ = mean (standard) σ = standard deviation Training Result SVM accuracy: 99.83% This training is trustable. Matching posture: Obtain skeleton data via Kinect Extract joint positions via pykinect library Calculate 11 features Because the angles extracted from virtual robot is different from real human’s skeleton angles, we decided use real data to train model in order to match the posture easily later. 8 skeleton angles – obtained by dot product 3 orientations – used for judge the direction of the arms and feet Use trained model to test user’s data Matching Pass: the distance between standard data and test data &lt; criteria Fail: predicted label is wrong predicted label is right but distance does’t meet the criteria correct posture Find the maximum angle of error and output the value to instrut user to correct his or her posture. 12345678910err = []max_joint = [ &quot;left elbow&quot;, &quot;left shoulder&quot;,&quot;right elbow&quot;, &quot;right shoulder&quot;, &quot;left knee&quot;, &quot;right knee&quot;, &quot;left hip&quot;, &quot;right hip&quot;, ]distance=numpy.linalg.norm(numpy.array(standardData[posture-1])-numpy.array(testData)) for i in range(len(testData)): err1 = abs(standardData[posture-1][i]-testData[i]) err.append(err1) max_err = max(err)for i in range(len(testData)): if (max_err == err[i]): print &apos;the #&apos;,max_joint[i], &apos;error, need to modify&apos;, &apos;Need to modify:&apos;, max_err, &apos;degrees&apos; User performs posture again until passing. Demo Correct posture Wrong posture Posture needs to be modified","categories":[{"name":"Computer science","slug":"Computer-science","permalink":"https://zayyyy.github.io/Blog/categories/Computer-science/"}],"tags":[{"name":"Intelligent","slug":"Intelligent","permalink":"https://zayyyy.github.io/Blog/tags/Intelligent/"}]},{"title":"斯德哥尔摩一日精粹","slug":"Stockholm","date":"2017-05-11T11:35:28.000Z","updated":"2017-07-25T11:56:25.000Z","comments":true,"path":"2017/05/11/Stockholm/","link":"","permalink":"https://zayyyy.github.io/Blog/2017/05/11/Stockholm/","excerpt":"记2017年3月3日第一次从Uppsala到Stockholm的短途旅行（好像也是最后一次。 一次心血来潮之举，前一天晚上只进行了简单的规划，结果我自认为这一日路线简直是精华，还把斯京交通坐了个遍（包括轮渡、地铁、公车），嘻嘻。注：Uppsala出发，购买SL一日票非常划算，斯京交通随便坐。","text":"记2017年3月3日第一次从Uppsala到Stockholm的短途旅行（好像也是最后一次。 一次心血来潮之举，前一天晚上只进行了简单的规划，结果我自认为这一日路线简直是精华，还把斯京交通坐了个遍（包括轮渡、地铁、公车），嘻嘻。注：Uppsala出发，购买SL一日票非常划算，斯京交通随便坐。 【行程地图】如下： 行程 10:00 - 11:00 出发 本来计划更早从Uppsala出发，结果睡过了头，不过毫不影响，10点从Uppsala C坐Commuter Train到Stockholm C，由于有UL月票，只需购买SL一日票（学生价：80kr+20kr卡片工本费）。一个小时的车程，如同坐公交车一样，随意找个位置坐下就行，这趟车竟然没有人查票，不过有发小广告的，没人看还二次回收，甚是节约成本。 11:00 - 12:00 城区与午餐 11点到斯京后，步行至Kajsas Fisk餐厅吃中饭，这是一家在TripAdvisor上排名最高的平价鱼餐厅，招牌Kajsas soppa(Kajsas鱼汤)（110kr）可免费续汤，有面包沙拉配套，汤很实诚有各种鱼肉，虾肉，蛤蜊等，个人喝多了有点咸，基本上一碗就足够了。饱腹之后，从中央车站所在的城区，顺着一整条步行街直走就能到老城区Gamla Stan，大约15min的脚程，会路过各种纪念品商店、有名的皇后大街、无数H&amp;M，然后走过一座桥就到老城区了。老城坐落在市中心的一座小岛上，封面图是从连接老城的桥上拍摄的，在桥上可以看到远方的骑士岛教堂，桥底的水清澈至极，倒映出的景色就像一幅文艺的水彩，去不了威尼斯，但可以在斯京感受一下”北方威尼斯”的风韵。 Kajsas restaurant Drottninggatan 12:00 - 12:30 卫兵换岗 斯德哥尔摩皇家卫兵每天都会在12:15进行换岗仪式，大概持续15min，有卫兵打卡执念的可以提前去占一个位置围观（比如我），我误打误撞正好12:15走到了皇家广场，工作日都围满了人…卫兵心里应该是暗爽的，天天被围观拍照蛤蛤蛤。 12:30 - 14:00 皇宫 如果没有参观过欧洲皇宫，亦或是对皇宫文化有迷之爱好的话，看完卫兵换岗，可以从旁边的入口参观瑞典皇宫（学生价80kr）。由the Royal Apartment开始，一共有3个区域，每去一个区域就会在门票上划掉一个景点，然而看完Royal Apartment，旁边有个楼梯可以直接去到The Tre Kronor Museum，不用绕到正门进去。Royal Apartment就是皇宫房间的陈列，反正讲究的是一个金碧辉煌，玻璃柜中精致的瓷器水晶，分分钟想要种草买一套回家。最后有一个陈列瑞典王妃婚纱的展厅，婚纱属于低调奢华的类型，有一双鞋底是心型的鞋子比较有意思，也想种草一个。The Tre Kronor Museum是一个地底的小型博物馆，其实就是以前旧王宫的遗址墙体。之后是参观the Treasury皇宫宝库，珍藏有瑞典王室各式各样的王冠和礼服，可以近距离体会皇室的奢华高贵，不过不能拍照= =","categories":[{"name":"Travel","slug":"Travel","permalink":"https://zayyyy.github.io/Blog/categories/Travel/"}],"tags":[{"name":"City","slug":"City","permalink":"https://zayyyy.github.io/Blog/tags/City/"}]}]}